package chap06.book.exercise;

public class p01_12 {
	/*
	01. 객체와 클래스에 대한 설명으로 틀린 것은 무엇입니까?
		3) 하나의 클래스로 하나의 객체만 생성할 수 있다.

	02. 클래스의 구성 멤버가 아닌 것은 무엇입니까?
		4) 로컬 변수(local variable)

	03. 필드, 생성자, 메소드에 대한 설명으로 틀린 것은 무엇입니까?
		4) 클래스는 반드시 필드와 메소드를 가져야 한다.

	04. 필드에 대한 설명으로 틀린 것은 무엇입니까? (x)
		오답 : 4) 필드는 초기값을 주지 않더라도 기본값으로 자동 초기화된다.
		정답 : 3) 필드는 반드시 생성자 선언 전에 선언되어야 한다. (순서 상관 없음)

	05. 생성자에 대한 설명으로 틀린 것은 무엇입니까?
		오답 : 2) 생성자는 다른 생성자를 호출하기 위해 this()를 사용할 수 있다.
		정답 : 1) 객체를 생성하려면 생성자 호출이 반드시 필요한 것은 아니다.

	06. 메소드에 대한 설명으로 틀린 것은 무엇입니까? (x)
		오답 : 1) 리턴값이 없는 메소드는 리턴 타입을 void로 해야 한다.
		정답 : 4) 메소드의 이름은 중복해서 선언할 수 없다.

	07. 메소드 오버로딩에 대한 설명으로 틀린 것은 무엇입니까?
		2) 반드시 리턴 타입이 달라야 한다.

	08. 인스턴스 멤버와 정적 멤버에 대한 설명으로 틀린 것은 무엇입니까?
		오답 : 3) 정적 필드와 정적 메소드는 객체 생성없이 클래스를 통해 접근할 수 있다.
		정답 : 2) 인스턴스 필드는 생성자 및 정적 블록에서 초기화될 수 있다.
			
	09. final 필드와 상수(static final)에 대한 설명으로 틀린 것은 무엇입니까?
		2) final 필드와 상수는 생성자에서 초기화될 수 있다.

 	10. 패키지에 대한 설명으로 틀린 것은 무엇입니까?
 		4) mycompany 패키지에 소속된 클래스는 yourcompany에 옮겨놓아도 동작한다.
 			
 	11. 접근 제한에 대한 설명으로 틀린 것은 무엇입니까?
 		3) default 접근 제한은 해당 클래스 내부에서만 사용을 허가한다.
 			
 	12. 다음 클래스에서 해당 멤버가 필드, 생성자, 메소드 중 어떤 것인지 빈칸을 채우세요.
 		필드, 생성자, 메소드
 	*/
}
