package chap05.book.exercise;

public class Exercise01_06 {
//	1. 참조 타입에 대한 설명으로 틀린 것은 무엇입니까?
//		4) 참조 타입은 null 값으로 초기화할 수 없다.
//
//	2. 자바에서 메모리 사용에 대한 설명으로 틀린 것은 무엇입니까?
//		3) 참조되지 않는 객체는 프로그램에서 직접 소멸 코드를 작성하는 것이 좋다.
//
//	3. String 타입에 대한 설명으로 틀린 것은 무엇입니까?
//		2) String 타입의 문자열 비교는 == 를 사용해야 한다.
//		
//	4. 배열을 생성하는 방법으로 틀린 것은 무엇입니까? 
//		2) int[][] array; array = {1,2,3};
//				
//	5. 배열의 기본 초기값에 대한 설명으로 틀린 것은 무엇입니까?
//		3) boolean 타입 배열 항목의 기본 초기값은 true이다.
//
//	6. 배열의 길이에 대한 문제입니다. array.length의 값과 array[2].length의 값은 얼마입니까?
//		3 , 5
}
